In [1]:
import pandas as pd
import numpy as np

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
df = pd.DataFrame([4,8,15,16,42], columns=['Series'])
df

   Series
0       4
1       8
2      15
3      16
4      42

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
lis = [i for i in range (10)]

In [4]:
df = pd.DataFrame(lis)
df

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

Q3. Create a Pandas DataFrame that contains the following data:
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female
Then, print the DataFrame.

In [5]:
df =pd.DataFrame({'Name':['Alice','Bob','Claire'], 'Age':[25,30,27], 'Gender': ['Female', 'Male', 'Female'  ]})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Q-4 dataframe is tabular representation of multiple pandas series, wherever pandas series is one column data

In [6]:
# Ans:- dataframe is tabular representation of multiple data in 2 dimensions where ,
# wherever pandas series is one column data in one dimension.
s = pd.Series([1, 2, 3, 4, 5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
df =pd.DataFrame({'Name':['Alice','Bob','Claire'], 'Age':[25,30,27], 'Gender': ['Female', 'Male', 'Female'  ]})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans:- Some of the most frequently used functions include:

loc and iloc: used for indexing and selecting subsets of data based on the labels or integer indices of rows and columns.

head and tail: used to view the top or bottom n rows of a DataFrame.

drop: used to remove rows or columns from a DataFrame.

groupby: used to group rows together based on one or more columns and perform aggregations on the resulting groups.

merge: used to combine two DataFrames based on a common column.

In [8]:
# drop a column
df = df.drop('Gender', axis=1)
df

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

Q-6 Which of the following is mutable in nature Series, DataFrame, Panel?

Ans:- All series, Dataframe and panel are mutable

In [9]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
ser = pd.Series([1,2,3,4,5,6,7,8,9])
ser1 = pd.Series([10,11,12,13,14,15,16,17,18])
merged = pd.concat([ser, ser1],axis=1)
merged

   0   1
0  1  10
1  2  11
2  3  12
3  4  13
4  5  14
5  6  15
6  7  16
7  8  17
8  9  18

In [10]:
type(merged)

pandas.core.frame.DataFrame

In [11]:
type(ser)

pandas.core.series.Series